
// Описание
// 
// Параметры:
// 	ТекПользователь - ПользовательИнформационнойБазы - 
// Возвращаемое значение:
// 	
Функция НайтиИлиСоздатьПользователя(ТекПользователь) Экспорт

	РезультатПоиска = НайтиПоНаименованию(ТекПользователь.Имя);

	Если (РезультатПоиска.Пустая()) Тогда

		НовыйПользователь = СоздатьЭлемент();
		НовыйПользователь.Наименование = ТекПользователь.Имя;
		НовыйПользователь.ПолноеИмя = ТекПользователь.ПолноеИмя;
		НовыйПользователь.Записать();

		РезультатПоиска = НовыйПользователь.Ссылка;
	КонецЕсли;

	Пользователь = РезультатПоиска.ПолучитьОбъект();
	Пользователь.ТаблицаПрав.Очистить();

	НаборПрав = Метаданные.Роли;

	Для Каждого Роль Из НаборПрав Цикл

		СтрокаТЧ = Пользователь.ТаблицаПрав.Добавить();
		СтрокаТЧ.ИмяРоли = Роль.Имя;
		СтрокаТЧ.Включена = ТекПользователь.Роли.Содержит(Роль);

	КонецЦикла;

	Пользователь.Записать();

	Возврат РезультатПоиска;

КонецФункции








