

Процедура ПередЗаписью(Отказ)
	
	ТекПользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	Если (ТекПользователь = Неопределено) Тогда	
		ТекПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		ТекПользователь.Имя = Наименование;
		ТекПользователь.ПолноеИмя = ПолноеИмя;				
	КонецЕсли;

	ТекПользователь.Роли.Очистить();

	Для Каждого СтрокаРоли Из ТаблицаПрав Цикл
		
		Если СтрокаРоли.Включена Тогда		
			Роль = Метаданные.Роли.Найти(СтрокаРоли.ИмяРоли);
			ТекПользователь.Роли.Добавить(Роль);
		КонецЕсли;
		
	КонецЦикла;
			
	ТекПользователь.Записать();
	
КонецПроцедуры
